Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: For examples of how to use these various types of values in switch statements, see Switch in Control Flow.
ja: これらのいろいろな型の値をswitch文で使う方法の例のために、スイッチを制御の流れで見てください。

source: For hexadecimal numbers with an exponent of exp, the base number is multiplied by 2exp:
ja: expの指数を持つある16進数に対して、その基数は２expを掛けられます：

source: For information about private, see Access Control.
ja: privateに対する情報として、アクセス制御を見てください。

source: For information about avoiding conflicting access to memory, see Memory Safety.
ja: メモリへのアクセスの衝突の回避についての情報として、メモリ安全を見てください。

source: For information about frozen and nonfrozen enumerations, see frozen.
ja: 凍結および非凍結列挙についての情報として、frozenを見てください。

source: For information about initialization and initializer syntax, see Initialization.
ja: 初期化とイニシャライザ構文についての情報として、初期化を見てください。

source: For information about key-value coding and key-value observing, see Key-Value Coding Programming Guide [https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/KeyValueCoding/index.html#//apple_ref/doc/uid/10000107i] and Key-Value Observing Programming Guide [https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/KeyValueObserving/KeyValueObserving.html#//apple_ref/doc/uid/10000177i].
ja: キー値コーディングとキー値監視についての情報として、キー値コーディングプログラミングガイド [https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/KeyValueCoding/index.html#//apple_ref/doc/uid/10000107i]とキー値監視プログラミングガイド [https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/KeyValueObserving/KeyValueObserving.html#//apple_ref/doc/uid/10000177i]を見てください。

source: For information about parameters with default values, see Default Parameter Values.
ja: 省略時の値を持つパラメータについての情報として、省略時のパラメータ値を見てください。

source: For information about passing a closure as an argument to a function, see Function Call Expression.
ja: クロージャを引数として関数に渡すことに関する情報については、関数呼び出し式を見てください。

source: For information about protocols, see Protocols.
ja: プロトコルについての情報として、Protocolsを見てください。

source: For information about reference types, see Structures and Enumerations Are Value Types.
ja: 参照型に関して詳しくは、構造体と列挙は値型ですを見てください。

source: For information about subscript declarations, see Protocol Subscript Declaration.
ja: 添え字宣言に関して詳しくは、プロトコル添え字宣言を見てください。

source: For information about the behavior of these operators, see Basic Operators and Advanced Operators.
ja: これらの演算子の挙動に関して詳しくは、基本の演算子と先進の演算子を見てください。

source: For information about the operators provided by the Swift standard library, including a complete list of the operator precedence groups and associativity settings, see Operator Declarations [https://developer.apple.com/documentation/swift/operator_declarations].
ja: スウィフト標準ライブラリによって提供される演算子についての情報として、演算子優先順位と結合性の設定の完全なリストを含めて、演算子宣言 [https://developer.apple.com/documentation/swift/operator_declarations]を見てください。

source: For information about the operators provided by the Swift standard library, see Operator Declarations [https://developer.apple.com/documentation/swift/operator_declarations].
ja: スウィフト標準ライブラリによって提供される演算子についての情報のために、演算子宣言 [https://developer.apple.com/documentation/swift/operator_declarations]を見てください。

source: For information about value types, see Structures and Enumerations Are Value Types.
ja: 値型に関して詳しくは、構造体と列挙は値型ですを見てください。

source: For information about weak references, see Strong Reference Cycles Between Class Instances.
ja: 弱い参照についての詳細は、クラスインスタンス間の強い参照循環を見てください。

source: For information on optional chaining, see Optional Chaining.
ja: オプショナル連鎖に関する情報のために、オプショナル連鎖を見てください。

source: For information on using playground literals in Xcode, see Add a color, file, or image literal [https://help.apple.com/xcode/mac/current/#/dev4c60242fc] in Xcode Help.
ja: Xcodeにおけるプレイグラウンドリテラルの使用に関するさらなる情報として、Add a color, file, or image literal [https://help.apple.com/xcode/mac/current/#/dev4c60242fc]をXcodeヘルプで見てください。

source: For instance methods on value types (that is, structures and enumerations) you place the mutating keyword before a method’s func keyword to indicate that the method is allowed to modify the instance it belongs to and any properties of that instance.
ja: 値型（すなわち、構造体と列挙）のインスタンスメソッドのために、あなたはmutatingキーワードをメソッドのfuncキーワードの前に置いて、メソッドがそれが属しているインスタンスおよびそのインスタンスのあらゆるプロパティを修正するのを許可されることを示します。

source: For instance, failable initializers are implemented for numeric type conversions.
ja: 例えば、いくつかの失敗できるイニシャライザが数値型変換のために実装されます。

source: For instance, in the example below, the use of Point in the type annotation refers to the tuple type (Int, Int).
ja: たとえば、下記の例で、型注釈においてPointを使うことは、タプル型(Int, Int)に言及します。

source: For instance, the pattern (x, y) matches the tuple (1, 2) and any other two-element tuple.
ja: たとえば、パターン(x, y)はタプル(1, 2)および他のどんな２要素タプルにでもマッチします。

source: For instance, the variadic parameter Int... is treated as [Int].
ja: たとえば、可変長パラメータInt...は[Int]とみなされます。

source: For more about for-in loops, see Control Flow.
ja: for-inループに関する詳細は、制御の流れを見てください。

source: For more about arrays and dictionaries, see Collection Types.
ja: 配列と辞書に関する詳細は、コレクション型を見てください。

source: For more about arrays, see Arrays.
ja: 配列に関する詳細は、配列を見てください。

source: For more about extensions, see Extensions.
ja: 拡張についてのより多くのために、拡張を見てください。

source: For more about generic where clauses, see Generic Where Clauses.
ja: 総称体where節に関する詳細は、総称体where節を見てください。

source: For more about generic types and collections, see Generics.
ja: 総称体型とコレクションに関する詳細は「総称体」を見てください。

source: For more about operator methods, see Operator Methods.
ja: 演算子メソッドについてさらに、演算子メソッドを見てください。

source: For more about ranges, see Range Operators.
ja: 範囲に関する詳細は、範囲演算子を見てください。

source: For more about reference and value semantics, see Structures and Enumerations Are Value Types and Classes Are Reference Types.
ja: 参照および値意味論に関する詳細は、構造体と列挙は値型ですとクラスは、参照型ですを見てください。

source: For more about the for-in loop, see For-In Loops.
ja: 更にfor-inループについて、for-inループを見てください。

source: For more about the if statement, see Control Flow.
ja: if文に関する詳細は、制御の流れを見てください。

source: For more about the final modifier, see Preventing Overrides.
ja: final修飾子に関する詳細は、オーバーライドを防ぐを見てください。

source: For more about these capabilities, see Properties, Methods, Initialization, Extensions, and Protocols.
ja: これらの能力に関する詳細は、プロパティ、メソッド、初期化、拡張、そしてプロトコルを見てください。

source: For more details, see Protocol Extensions.
ja: 詳細は、プロトコル拡張を見てください。

source: For more discussion and examples of in-out parameters, see In-Out Parameters.
ja: in-outパラメータの議論と例のために、in-outパラメータを見てください。

source: For more information about Dictionary subscripting, see Accessing and Modifying a Dictionary.
ja: Dictionaryで添え字を使うことの詳細については、辞書へのアクセスと修正を見てください。

source: For more information about capture lists, see Capture Lists.
ja: キャプチャリストについての更なる情報として、キャプチャリストを見てください。

source: For more information about compound cases, see Compound Cases.
ja: 複合ケース節についてのさらなる情報として、複合ケース節を見てください。

source: For more information about conforming to protocols, see Protocols.
ja: プロトコルに準拠することについての更なる情報は、プロトコルを見てください。

source: For more information about constants and for guidance about when to use them, see Constants and Variables and Stored Properties.
ja: 定数の詳細について、そしていつそれらを使うべきかの手引きとして、定数と変数および格納プロパティを見てください。

source: For more information about deinitializers, see Deinitialization.
ja: デイニシャライザの詳細については、デイニシャライザを見てください。

source: For more information about escaping closures, see Escaping Closures.
ja: 脱出クロージャについてのさらなる情報として、脱出クロージャを見てください。

source: For more information about generic where clauses and to see an example of one in a generic function declaration, see Generic Where Clauses.
ja: 総称体where節のさらなる情報のために、そして総称体関数宣言におけるそれの一例を見るために、総称体where節を見てください。

source: For more information about how to use the optional modifier and for guidance about how to access optional protocol members—for example, when you’re not sure whether a conforming type implements them—see Optional Protocol Requirements.
ja: optional修飾子を使う方法についての更なる情報のために、そしてオプショナルプロトコルメンバーにアクセスする方法についての手引きとして ― 例えば、あなたがある準拠型がそれらを実装するかどうか確信が持てない時など ― オプショナルのプロトコル要件を見てください。

source: For more information about how to use the optional declaration modifier and for guidance about how to access optional protocol members—for example, when you’re not sure whether a conforming type implements them—see Optional Protocol Requirements.
ja: optional宣言修飾子を働かせる方法に関する詳細は、そして、オプショナルのプロトコルメンバーにアクセスする方法 ― 例えば、ある準拠している型がそれらを実装するかどうかについてあなたが確信が持てない時など ― についての手引きとしてオプショナルのプロトコル要件を見てください。

source: For more information about implicitly unwrapped optional types, see Implicitly Unwrapped Optionals.
ja: 暗黙的にアンラップされるオプショナル型の詳細については、暗黙的にアンラップされるオプショナルを見てください。

source: For more information about initializer delegation, see Initializer Delegation for Value Types and Initializer Delegation for Class Types.
ja: イニシャライザ委任についての更なる情報として、値型のためのイニシャライザ委任とクラス型のためのイニシャライザ委任を見てください。

source: For more information about memory safety and memory exclusivity, see Memory Safety.
ja: メモリ安全とメモリ排他についての更なる情報として、メモリ安全を見てください。

source: For more information about pattern matching, see Patterns.
ja: パターンマッチングについての更なる情報として、パターンを見てください。

source: For more information about precedence groups and to see the syntax for defining your own operators and precedence groups, see Operator Declaration.
ja: 優先順位グループについてのさらなる情報として、そしてあなた独自の演算子と優先順位グループを定義するための構文を見るには、演算子宣言を見てください。

source: For more information about subscripting and to see examples of subscript declarations, see Subscripts.
ja: 添え字に関するより多くの情報のために、そして、添え字宣言の例を見るために、添え字を見てください。

source: For more information about the String type, see Strings and Characters and String [https://developer.apple.com/documentation/swift/string].
ja: String型についての詳細として、文字列と文字とString [https://developer.apple.com/documentation/swift/string]を見てください。

source: For more information about the fallthrough statement, see Fallthrough Statement below.
ja: fallthrough文の詳細については、下記のフォールスルー文を見てください。

source: For more information about the patterns you can use in a catch clause, see Patterns.
ja: あなたがcatch節において使うパターンについての更なる情報として、パターンを見てください。

source: For more information about this attribute, see Attributes.
ja: この属性についてのさらなる情報として、属性を見てください。

source: For more information about this class, see Handling Cocoa Errors in Swift [https://developer.apple.com/documentation/swift/cocoa_design_patterns/handling_cocoa_errors_in_swift].
ja: このクラスについてのさらなる情報として、CocoaエラーをSwiftにおいて処理する [https://developer.apple.com/documentation/swift/cocoa_design_patterns/handling_cocoa_errors_in_swift]を見てください。

source: For more information about type casting and to see examples that use the type-casting operators, see Type Casting.
ja: 型キャストに関するより多くの情報のために、そして、型キャスト演算子を使用する例をより多く見るために、型キャストを見てください。

source: For more information about using Array with Foundation and Cocoa, see Bridging Between Array and NSArray [https://developer.apple.com/documentation/swift/array#2846730].
ja: FoundationとCocoaとともにArrayを使うことについてのさらなる情報として、ArrayとNSArrayの間のブリッジ [https://developer.apple.com/documentation/swift/array#2846730]を見てください。

source: For more information about using Dictionary with Foundation and Cocoa, see Bridging Between Dictionary and NSDictionary [https://developer.apple.com/documentation/swift/dictionary#2846239].
ja: FoundationとCocoaとともにDictionaryを使うことについてのさらなる情報として、DictionaryとNSDictionaryの間のブリッジ [https://developer.apple.com/documentation/swift/dictionary#2846239]を見てください。

source: For more information about using Set with Foundation and Cocoa, see Bridging Between Set and NSSet [https://developer.apple.com/documentation/swift/set#2845530].
ja: FoundationとCocoaとともにSetを使うことについてのさらなる情報として、SetとNSSetの間のブリッジ [https://developer.apple.com/documentation/swift/set#2845530]を見てください。

source: For more information about using String with Foundation and Cocoa, see Bridging Between String and NSString [https://developer.apple.com/documentation/swift/string#2919514].
ja: FoundationとCocoaとともにStringを使うことについてのさらなる情報として、StringとNSStringの間のブリッジ [https://developer.apple.com/documentation/swift/string#2919514]を見てください。

source: For more information about using key paths in Swift code that interacts with Objective-C APIs, see Using Objective-C Runtime Features in Swift [https://developer.apple.com/documentation/swift/using_objective_c_runtime_features_in_swift].
ja: Objective-C APIと相互作用するSwiftコードにおけるキーパスの使用についてのさらなる情報として、Objective-Cランタイム機能をSwiftで使用する [https://developer.apple.com/documentation/swift/using_objective_c_runtime_features_in_swift]を見てください。

source: For more information about using key paths in code that interacts with Objective-C APIs, see Using Objective-C Runtime Features in Swift [https://developer.apple.com/documentation/swift/using_objective_c_runtime_features_in_swift].
ja: Objective-C APIと相互作用するコードにおけるキーパスの使用についてのさらなる情報として、Objective-Cランタイム機能をSwiftで使用する [https://developer.apple.com/documentation/swift/using_objective_c_runtime_features_in_swift]を見てください。

source: For more information about using multiple optional chaining operations, see Linking Multiple Levels of Chaining.
ja: 複数のオプショナル連鎖演算を使用することについての更なる情報として、連鎖の複数の階層を結ぶを見てください。

source: For more information about using selectors in Swift code that interacts with Objective-C APIs, see Using Objective-C Runtime Features in Swift [https://developer.apple.com/documentation/swift/using_objective_c_runtime_features_in_swift].
ja: Objective-C APIと相互作用するSwiftコードにおけるセレクタの使用についてのさらなる情報として、Objective-Cランタイム機能をSwiftで使用する [https://developer.apple.com/documentation/swift/using_objective_c_runtime_features_in_swift]を見てください。

source: For more information and examples of capture lists, see Resolving Strong Reference Cycles for Closures.
ja: キャプチャリストのより多くの情報と例のために、クロージャのための強い参照循環の解消を見てください。

source: For more information and examples of closure expressions, see Closure Expressions.
ja: クロージャ式のより多くの情報と例のために、クロージャ式を見てください。

source: For more information and examples, see Associated Types.
ja: より多くの情報と例のために、関連型を見てください。

source: For more information and to see an example of how to use property observers, see Property Observers.
ja: より多くの情報のために、そして、プロパティオブザーバーを使う方法の例を見るために、プロパティオブザーバーを見てください。

source: For more information and to see an example, see In-Out Parameters.
ja: より多くの情報のために、そして、例を見るために、In-Outパラメータを見てください。

source: For more information and to see examples of cases with associated value types, see Associated Values.
ja: より多くの情報のために、そして関連値型をもつケース節の例を見るために、関連値を見てください。

source: For more information and to see examples of cases with raw-value types, see Raw Values.
ja: より多くの情報のために、そして「生の値」型をもつケース節の例を見るために、生の値を見てください。

source: For more information and to see examples of computed properties, see Computed Properties.
ja: より多くの情報のために、そして、計算プロパティの例を見るために、計算プロパティを見てください。

source: For more information and to see examples of failable initializers, see Failable Initializers.
ja: さらなる情報と、失敗できるイニシャライザの例を見るために、失敗できるイニシャライザを見てください。

source: For more information and to see examples of how to use try, try?, and try!, see Error Handling.
ja: より多くの情報のために、そしてtry、try?、そしてtry!文を使う方法の例を見るために、エラーを処理するを見てください。

source: For more information and to see examples of how to use statement labels, see Labeled Statements in Control Flow.
ja: より多くの情報のために、そして、文ラベルを使用する方法の例を見るために、ラベルをつけられた文を制御の流れで見てください。

source: For more information and to see examples that show how to use optional types, see Optionals.
ja: より多くの情報のために、そしてオプショナル型を使う方法を示す例を見るために、オプショナルを見てください。

source: For more information on bridging, see Working with Foundation Types [https://developer.apple.com/documentation/swift/imported_c_and_objective_c_apis/working_with_foundation_types].
ja: ブリッジに関するより多くの情報のために、Foundation型を扱う [https://developer.apple.com/documentation/swift/imported_c_and_objective_c_apis/working_with_foundation_types]を見てください。

source: For more information on functions with the Never return type, see Functions that Never Return.
ja: Never戻り型を持つ関数でのさらなる情報は、決して戻らない関数を見てください。

source: For more information on property observers, see Property Observers.
ja: プロパティオブザーバーの詳細については、プロパティオブザーバーを見てください。

source: For more information on required initializers, see Required Initializers.
ja: 必須イニシャライザに関する更なる情報として、必須イニシャライザを見てください。

source: For more information see Type Variable Properties.
ja: 更なる情報として、型変数プロパティを見てください。

source: For more information, see type(of:) [https://developer.apple.com/documentation/swift/2885064-type] in the Swift standard library.
ja: 詳細は、type(of:) [https://developer.apple.com/documentation/swift/2885064-type]をスウィフト標準ライブラリで見てください。

source: For more information, see Assigning Constant Properties During Initialization.
ja: 更なる情報として、初期化の間に定数プロパティを割り当てるを見てください。

source: For more information, see Constant Declaration.
ja: 更なる情報として、定数宣言を見てください。

source: For more information, see Extensions.
ja: 詳細は、拡張を見てください。

source: For more information, see Failable Initializers.
ja: さらなる情報として、失敗できるイニシャライザを見てください。

source: For more information, see Inheritance, Type Casting, Deinitialization, and Automatic Reference Counting.
ja: 詳細は、継承、型キャスト、デイニシャライズ、そして自動参照カウントを見てください。

source: For more information, see Properties, Methods, Subscripts, Initialization, Extensions, and Protocols.
ja: 詳細は、プロパティ, メソッド、添え字、初期化、拡張、そしてプロトコルを見てください。

source: For more information, see Structures and Classes.
ja: 詳細は、クラスと構造体を見てください。

source: For more information, see Importing Swift into Objective-C [https://developer.apple.com/documentation/swift/imported_c_and_objective-c_apis/importing_swift_into_objective-c].
ja: さらなる情報は、SwiftをObjective-Cにインポートする [https://developer.apple.com/documentation/swift/imported_c_and_objective-c_apis/importing_swift_into_objective-c]を見てください。

source: For more information, see Automatic Initializer Inheritance below.
ja: 更なる情報は、以下の自動的なイニシャライザ継承を見てください。

source: For more information, see Strong Reference Cycles for Closures.
ja: 詳細は、クロージャのための強い参照循環を見てください。

source: For more information, see Optional Binding.
ja: 更なる情報として、オプショナルの束縛を見てください。

source: For more information, see Sets.
ja: 更なる情報として、集合を見てください。

source: For more information, see Functions with Multiple Return Values.
ja: 詳細は、「複数の戻り値をもつ関数」を見てください。

source: For more information, see Checking for Protocol Conformance.
ja: 更なる情報として、プロトコル準拠の確認を見てください。

source: For more information, see Declaration Attributes.
ja: 更なる情報として、宣言属性を見てください。

source: For more information, see Precedence Group Declaration.
ja: さらなる情報は、優先順位グループ定義を見てください。

source: For more information, see Identity Operators.
ja: 更なる情報として、同一性演算子を見てください。

source: For more information, see Type-Casting Operators.
ja: 更なる情報として、型キャスト演算子を見てください。

source: For more information, see Raw Values and Enumerations with Cases of a Raw-Value Type.
ja: 更なる情報として、生の値と「生の値」型のケース節を持つ列挙を見てください。

source: For more information, see the propertyWrapper section of the Attributes chapter.
ja: さらなる情報として、属性の章のpropertyWrapperの節を見てください。

source: For multithreaded code, use Thread Sanitizer [https://developer.apple.com/documentation/code_diagnostics/thread_sanitizer] to help detect conflicting access across threads.
ja: マルチスレッドコードに対しては、Thread Sanitizer [https://developer.apple.com/documentation/code_diagnostics/thread_sanitizer]を使うことでスレッドをまたぐアクセス衝突を検出する助けとしてください。

source: For readability, a compound case can also be written over multiple lines.
ja: 可読性のために、複合ケース節はまた複数行にわたって書かれることもできます。

source: For simple numeric values, the unary minus operator converts positive numbers into their negative equivalent and vice versa.
ja: 単純な数の値のために、この単項マイナス演算子は正の数をその負の等価物に変えます、逆の場合も同じです。

source: For some enumerations, it’s useful to have a collection of all of that enumeration’s cases.
ja: いくつかの列挙に対して、その列挙の持つケース節の全てからなるコレクションを持つことは役に立ちます。

source: For the numberOfLegs dictionary above, the key-value subscript takes and returns a value of type Int?, or “optional int”.
ja: 上のnumberOfLegs辞書のために、その「キーと値」添え字は型Int?、つまり「オプショナルのint」の値を受け取りそして返します。

source: For the example above, this enables the names of Suit, Rank, and Values to be kept deliberately short, because their names are naturally qualified by the context in which they are defined.
ja: 上の例で、これは、Suit、Rank、そしてValuesの名前が故意に短いままにしておかれるようにします、なぜなら、それらが定義される文脈によってそれらの名前が自然に修飾されて限定されるからです。

source: For the numeric cards, it uses the rank’s raw Int value.
ja: 数字カードのために、それは等級の生のInt値を使います。

source: For the other three properties, new VideoMode instances will be initialized with an interlaced setting of false (meaning “noninterlaced video”), a playback frame rate of 0.0, and an optional String value called name.
ja: 他の３つのプロパティのために、新しいVideoModeインスタンスは、falseに設定されるinterlaced（「ノンインタレース・ビデオ」を意味します）、0.0の再生フレームレート、nameというオプショナルのString値で初期化されます。

source: For the purpose of access control, extensions to the same type that are in the same file share an access-control scope.
ja: アクセス制御の目的のために、同じ型で同じファイルの中にあるものに対する拡張それらは、アクセス制御スコープを共有します。

source: For the purposes of these rules, the characters (, [, and { before an operator, the characters ), ], and } after an operator, and the characters ,, ;, and : are also considered whitespace.
ja: これらの規則を理由に、演算子の前の文字(、[、および{、演算子の後の文字)、]、および}、そして文字,、;、および:は、また、空白と見なされます。

source: For the purposes of this example, +++ is treated as a new “prefix doubling” operator.
ja: この例の目的のために、+++は新しい「接頭辞倍加」演算子とみなされます。

source: For the same reason, you can’t pass the same value to multiple in-out parameters.
ja: 同じ理由のために、あなたは複数のin-outパラメータに対して同じ値を渡すことができません。

source: For these types, Objective-C methods typically return a special value (such as NSNotFound) to indicate the absence of a value.
ja: これらの型のために、Objective-Cメソッドは、値の欠如を示すために概して特別な値（例えばNSNotFound）を返します。

source: For this calculation, the individual counter values each time through the loop are unnecessary—the code simply executes the loop the correct number of times.
ja: この計算では、ループするごとに個別のカウンタ値は必要ではありません ― このコードは単に正しい回数ループを実行するだけです。

source: For this reason, Swift strings can’t be indexed by integer values.
ja: この理由のために、スウィフトの文字列は整数値でインデックス付けされることができません。

source: For this reason, the default implementation provided by the Loggable protocol is used instead.
ja: この理由のために、Loggableプロトコルによって提供される省略時の実装が代わりに使われます。

source: For value types, you use self.init to refer to other initializers from the same value type when writing your own custom initializers.
ja: 値型のために、あなたはself.initを使って、あなた独自のあつらえのイニシャライザを書くとき同じ値型の他のイニシャライザに言及します。

source: For-In Loops
ja: for-inループ

source: For-In Statement
ja: For-In文

source: Forced-Value Expression
ja: 強制された値式

source: Foundation also extends String to expose methods defined by NSString.
ja: Foundationはまた、Stringを拡張してNSStringによって定義されるメソッドに触れさせます。

source: Frozen types, the types of the stored properties of frozen structures, and the associated values of frozen enumeration cases must be public or marked with the usableFromInline attribute.
ja: 凍結型、凍結構造体の格納プロパティの型、そして凍結列挙ケース節の関連値は、パブリックであるかusableFromInline属性で印されなければなりません。

source: Function Argument Labels and Parameter Names
ja: 関数の引数ラベルとパラメータ名

source: Function Call Expression
ja: 関数呼び出し式

source: Function Declaration
ja: 関数宣言

source: Function Parameters and Return Values
ja: 関数のパラメータと戻り値

source: Function Type
ja: 関数型

source: Function Types
ja: 関数型

source: Function Types as Parameter Types
ja: パラメータ型としての関数型

source: Function Types as Return Types
ja: 戻り型としての関数型

source: Function call expressions have the following form:
ja: 関数呼び出し式は、以下の形式を持ちます：

source: Function declarations are declared using the func keyword and have the following form:
ja: 関数宣言は、キーワードfuncを使って宣言されます、そして以下の形式を持ちます：

source: Function parameters and return values are extremely flexible in Swift.
ja: 関数パラメータと戻り値は、スウィフトではとても柔軟です。

source: Function parameters are a comma-separated list where each parameter has one of several forms.
ja: 関数パラメータはひとつの「コンマ区切り」のリストです、そこにおいて各パラメータはいくつかの書式のうちの１つを持ちます。

source: Function parameters are constants by default.
ja: 関数パラメータは、特に何もしなければ定数です。

source: Function parameters can have both a name (for use within the function’s body) and an argument label (for use when calling the function), as described in Function Argument Labels and Parameter Names.
ja: 関数パラメータは、名前（関数の本文内で使うため）と引数ラベル（関数を呼び出すとき使うため）の両方を持つことができます、関数の引数ラベルとパラメータ名で記述されるように。
